БухЭксп/Catalogs/CW_ПредопреленныеФункцииШаблоновДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПредопреленныеФункцииШаблоновДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФункции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеНазначенияШаблонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НазначениеШаблона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПредопреленныеФункцииШаблоновДокументов/Forms/ФормаПодбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НазначениеШаблонаПустаяСсылка", НазначениеШаблонаПустаяСсылка);
	
	ЗаполнитьДеревоФункцийНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьДеревоФункцийНаСервере() 
	
	НазначениеШаблона = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(НазначениеШаблонаПустаяСсылка));
	МассивПоказателей = CW_ШаблоныДокументовФункцииВызовСервераПовторноеИспользование.ПолучитьИдентификаторыПараметровШаблона(НазначениеШаблона);
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ПредопреленныеФункцииШаблоновДокументовДоступныеНазначенияШаблонов.Ссылка КАК Ссылка,
	               |	CW_ПредопреленныеФункцииШаблоновДокументовДоступныеНазначенияШаблонов.Ссылка.ЭтоГруппа КАК ЭтоГруппа,
	               |	CW_ПредопреленныеФункцииШаблоновДокументовДоступныеНазначенияШаблонов.Ссылка.ИдентификаторФункции КАК ИдентификаторФункции
	               |ИЗ
	               |	Справочник.CW_ПредопреленныеФункцииШаблоновДокументов.ДоступныеНазначенияШаблонов КАК CW_ПредопреленныеФункцииШаблоновДокументовДоступныеНазначенияШаблонов
	               |ГДЕ
	               |	CW_ПредопреленныеФункцииШаблоновДокументовДоступныеНазначенияШаблонов.НазначениеШаблона = &НазначениеШаблона
	               |ИТОГИ ПО
	               |	Ссылка ТОЛЬКО ИЕРАРХИЯ";    
	
	Запрос.УстановитьПараметр("НазначениеШаблона", НазначениеШаблона);  
	

	РезультатЗапроса = Запрос.Выполнить();
	
	ДеревоЗначений = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

	ТДеревоФункций = РеквизитФормыВЗначение("ДеревоФункций");
	
	ЗаполнитьДеревоФункций(ДеревоЗначений.Строки, ТДеревоФункций.Строки, МассивПоказателей); 
	
	ЗначениеВРеквизитФормы(ТДеревоФункций, "ДеревоФункций");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоФункций(СтрокиИсточника, СтрокиПриемника, МассивПоказателей)
	
	Для Каждого СтрокаИсточника из СтрокиИсточника Цикл
		
		НоваяСтрока = СтрокиПриемника.Добавить();
		НоваяСтрока.Ссылка 			= СтрокаИсточника.Ссылка;
		НоваяСтрока.ИндексКартинки 	= ?(СтрокаИсточника.ЭтоГруппа, 0, 3);
		НоваяСтрока.Выбран 			= МассивПоказателей.Найти(СтрокаИсточника.ИдентификаторФункции) <> Неопределено;  
		
		Если СтрокаИсточника.Строки.Количество() > 0 Тогда
			ЗаполнитьДеревоФункций(СтрокаИсточника.Строки, НоваяСтрока.Строки, МассивПоказателей);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФункцийВыборПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоФункций.ТекущиеДанные;
	Если ТекущиеДанные.Выбор > 1 Тогда
		ТекущиеДанные.Выбор = 0;
	КонецЕсли; 
	
	ИдентификаторСтроки = Элементы.ДеревоФункций.ТекущаяСтрока; 
	УстановитьФлагиПодчиненныхСтрокДерева(ИдентификаторСтроки);
	УстановитьФлагиРодительскихСтрокДерева(ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагиПодчиненныхСтрокДерева(ИдентификаторСтроки)
	
	СтрокаТекущая  = ДеревоФункций.НайтиПоИдентификатору(ИдентификаторСтроки); 
	
	Если СтрокаТекущая.ИндексКартинки = 0 Тогда 
		//Это группа
		ЭлементыСтроки = СтрокаТекущая.ПолучитьЭлементы();
		Для Каждого СтрокаДерева из ЭлементыСтроки ЦИкл
			СтрокаДерева.Выбор = СтрокаТекущая.Выбор; 
			Если СтрокаДерева.ИндексКартинки = 0 Тогда   
				ИдентификаторСтрокиДерева = СтрокаДерева.ПолучитьИдентификатор();
				УстановитьФлагиПодчиненныхСтрокДерева(ИдентификаторСтрокиДерева);
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;  

КонецПроцедуры
	
&НаКлиенте
Процедура УстановитьФлагиРодительскихСтрокДерева(ИдентификаторСтроки)
	
	СтрокаТекущая  = ДеревоФункций.НайтиПоИдентификатору(ИдентификаторСтроки); 
	
	СтрокаРодитель = СтрокаТекущая.ПолучитьРодителя(); 
	Пока СтрокаРодитель <> Неопределено Цикл
		
		ЗначениеПометки 	= СтрокаРодитель.Выбор;
		ЭлементыРодителя	= СтрокаРодитель.ПолучитьЭлементы();
		
		Для Индекс = 0 По ЭлементыРодителя.Количество()-1 Цикл 
			СтрокаДерева =  ЭлементыРодителя.Получить(Индекс);
			Если Индекс = 0 Тогда
				ЗначениеПометки = СтрокаДерева.Выбор;
				Продолжить;
			КонецЕсли;  
			Если ЗначениеПометки <> СтрокаДерева.Выбор Тогда
				ЗначениеПометки = 2;
			КонецЕсли;
		КонецЦикла;
		
		СтрокаРодитель.Выбор = ЗначениеПометки;
		
		СтрокаРодитель = СтрокаРодитель.ПолучитьРодителя(); 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьВыбор(Команда)
	
	ВыбранныеЭлементы = ВыполнитьВыборНаСервере();
	ОповеститьОВыборе(ВыбранныеЭлементы); 
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьВыборНаСервере()
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоФункций");
	
	Отбор = Новый Структура("Выбор,ИндексКартинки", 1, 3); //Ишем только элементы
	МассивСтрок = ДеревоЗначений.Строки.НайтиСтроки(Отбор, Истина);  
	
	ВыбранныеЭлементы = Новый Массив;
	Для Каждого СтрокаДерева из МассивСтрок Цикл
		ВыбранныеЭлементы.Добавить(СтрокаДерева.Ссылка);
	КонецЦикла;   
	
	Возврат ВыбранныеЭлементы;
	
КонецФункции


&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьСнятьПометки(0);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьСнятьПометки(1);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьПометки(Пометка)   
	
	ЭлементыДерева = ДеревоФункций.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из ЭлементыДерева Цикл
		СтрокаДерева.Выбор = Пометка;
		ИдентификаторСтроки = СтрокаДерева.Получитьидентификатор(); 
		УстановитьФлагиПодчиненныхСтрокДерева(ИдентификаторСтроки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокФункций(Команда)

	ОбновитьСписокНаСервере();    
	
	ЭлементыДерева = ДеревоФункций.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из ЭлементыДерева Цикл
		Элементы.ДеревоФункций.Развернуть(СтрокаДерева.Получитьидентификатор(), Ложь);
	КонецЦикла;  
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере()
	
	Справочники.CW_ПредопреленныеФункцииШаблоновДокументов.ЗаполнитьМетодыПредопределенныхФункций();
	ОбновитьПовторноИспользуемыеЗначения(); 
	
	ЭлементыДеррева = ДеревоФункций.ПолучитьЭлементы();
	ЭлементыДеррева.Очистить();
	
	ЗаполнитьДеревоФункцийНаСервере();
	
КонецПроцедуры
